{
    "item": [
        {
            "description": "The market rally saw modest losses Monday as Apple dipped after unveiling its $3,499 Vision Pro goggles. Tesla leads five stocks in buy areas.",
            "guid": "c6da3c1d-b5b3-3bcd-94a5-6077be4ddb14",
            "link": "https://finance.yahoo.com/m/c6da3c1d-b5b3-3bcd-94a5-6077be4ddb14/market-rally-holds-bulk-of.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 21:07:51 +0000",
            "title": "Market Rally Holds Bulk Of Recent Gains Despite Apple Reversal; 5 Stocks In Buy Areas"
        },
        {
            "description": "Apple unveiling its Vision Pro mixed reality headset, the SEC suing crypto giant Binance, and Saudi Arabia pledging to cut production by one million barrels a day- these are just some of the top headlines the Yahoo Finance Live team is watching.",
            "guid": "ac416879-5954-3110-8a1b-d923bb981419",
            "link": "https://finance.yahoo.com/video/apples-headset-revealed-sec-sues-210701125.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 21:07:01 +0000",
            "title": "Apple's headset revealed, SEC sues Binance, oil production cut: Top stories"
        },
        {
            "description": "Apple has revealed iOS 17, with a host of new features for the iPhone.  The new update includes updates to central apps, including Messages, FaceTime and the Phone app.  It also adds a new app, in the form of “Journal”, which Apple says will help people practise gratitude.",
            "guid": "0e796f53-1eda-32e6-909b-605a82a2a115",
            "link": "https://www.independent.co.uk/tech/ios-17-iphone-update-apple-new-b2351853.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 21:05:12 +0000",
            "title": "iOS 17: Apple adds host of new features to iPhone with new software update"
        },
        {
            "description": "U.S. equities gave up early gains as initial enthusiasm for Apple (AAPL) new mixed-reality headset faded, and a report showing the services industries grew at a slower pace than anticipated raised concerns about economic expansion.  Apple shares began the session trading at a record high ahead of the introduction of the VR Pro headset, which some had labeled the company’s most-important product since the iPhone.  EPAM Systems (EPAM) shares plummeted after the engineering software firm slashed its guidance, saying customers have become “cautious” about spending.",
            "guid": "99087a9c-74fd-3711-901a-c1488c5f90a3",
            "link": "https://finance.yahoo.com/m/99087a9c-74fd-3711-901a-c1488c5f90a3/markets-drop-as-early-session.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:46:19 +0000",
            "title": "Markets Drop as Early Session Gains Fade in the Afternoon"
        },
        {
            "description": "The Dow Jones Industrial Average fell 0.6%, or about 200 points, as markets cooled off from Friday's blistering rally. Amgen rose more than any other stock, but Intel led the index lower.",
            "guid": "9a9f25d4-39b3-3db2-9e38-17c36331bafb",
            "link": "https://finance.yahoo.com/m/9a9f25d4-39b3-3db2-9e38-17c36331bafb/dow-jones-today%3A-apple.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:43:40 +0000",
            "title": "Dow Jones Today: Apple Headset Can’t Lift Index"
        },
        {
            "description": "Headset marks a shift towards ‘spatial computing’, says CEO Tim Cook",
            "guid": "f3344f22-d13c-3551-b43e-0fce47621e31",
            "link": "https://www.independent.co.uk/tech/apple-vision-pro-headset-vr-iphone-b2351888.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:42:23 +0000",
            "title": "Apple launches Vision Pro, a VR headset it hopes will be most important product since iPhone"
        },
        {
            "description": "Apple has a long history of designing products that aren't the first to be introduced in a particular category but still redefine the market.  Heralded by a now-most famous TV commercial, the Macintosh computer lived up to the revolutionary promise made by Apple co-founder Steve Jobs during its 1984 unveiling.  Among other things, the Mac ushered in the era of the graphical user interface (known as “GUI” in tech parlance) and the navigational mouse.",
            "guid": "99f09e2b-807e-3493-90d4-32a16f386424",
            "link": "https://finance.yahoo.com/news/see-apples-pivotal-product-announcements-204028952.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:40:28 +0000",
            "title": "See Apple's pivotal product announcements through history"
        },
        {
            "description": "Apple shares hit an all-time high on Monday as the company released its long-awaited mixed reality headset.",
            "guid": "6f7053ec-4c80-3496-ac12-1f0471496248",
            "link": "https://finance.yahoo.com/m/6f7053ec-4c80-3496-ac12-1f0471496248/apple-reveals-vision-pro.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:37:50 +0000",
            "title": "Apple Reveals Vision Pro Headset, Its First New Hardware in Eight Years"
        },
        {
            "description": "Apple is officially entering the headset business, announcing its Vision Pro mixed reality headset at its annual WWDC event. There was a lot of excitement about the announcement, but the $3,499 price tag may turn away some potential buyers. Eric Abbruzzese, ABI Research Research Director, and Bob O'Donnell, TECHnalysis Research President & Chief Analyst join Yahoo Finance Live to break down some of the key themes and announcements from the event. ",
            "guid": "b63d2288-3ffb-316e-aa56-b42f74da0980",
            "link": "https://finance.yahoo.com/video/apple-unveils-vision-pro-mixed-203744361.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:37:44 +0000",
            "title": "Apple unveils Vision Pro mixed reality headset, but $3,499 price tag 'a tough pill to swallow', says analyst"
        },
        {
            "description": "Any tech fan that watched Apple's June 5 WWDC presentation on its new augmented reality headset, Vision Pro, is probably thinking that Apple just rang the death knell on Meta's funeral -- at least as far as its Reality Labs projects are concerned.  At least, that's what folks on Twitter are saying after watching the stunning Apple  presentation -- and admittedly, it's pretty funny to compare a mixed-reality visor with \"4K screens for each eye\" to, well, this.",
            "guid": "ca445962-2a47-3150-a1a5-207fc5a8be42",
            "link": "https://finance.yahoo.com/m/ca445962-2a47-3150-a1a5-207fc5a8be42/apple%27s-new-headset-looks.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:30:00 +0000",
            "title": "Apple's New Headset Looks Incredible -- But Here's Why Meta Is Still in the Game"
        },
        {
            "description": "Unity's software will be used in Apple's new headset. After Apple's announcement, Unity stock had its best intraday performance since November 10.",
            "guid": "735f03d7-5a28-4386-8e92-37c855c462fe",
            "link": "https://finance.yahoo.com/news/apples-mixed-reality-headset-announcement-sends-unity-stock-soaring-202949563.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:29:49 +0000",
            "title": "Apple's mixed reality headset announcement sends Unity stock soaring"
        },
        {
            "description": "Apple's big headset announcement, Saudi Arabia's production cut, and Ford shares get an upgrade. Yahoo Finance live breaks down the trending tickers of the day.",
            "guid": "8d89f435-c6d2-32a9-98d8-db5e320e28a5",
            "link": "https://finance.yahoo.com/video/apples-wwcd-oil-production-cuts-202506159.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:25:06 +0000",
            "title": "Apple's WWDC, oil production cuts, Ford upgrade: Trending tickers"
        },
        {
            "description": "Apple making a slew of announcements at its annual WWDC event, including a mixed reality headset called the \"Vision Pro\" and a new 15-inch MacBook Air. Yahoo Finance tech editor Dan Howley gives the rundown on the reveals.",
            "guid": "1dc3e348-c8f3-3a8c-9921-bf4f31eb228c",
            "link": "https://finance.yahoo.com/video/apples-vision-pro-vr-headset-202431789.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:24:31 +0000",
            "title": "Apple's Vision Pro VR headset is company's first new landmark product since 2014"
        },
        {
            "description": "Despite the intraday reversal in Apple, Microsoft, Alphabet, Amazon, and Tesla, all helped the Nasdaq 100 outperform the other indexes as the small caps disappointed.",
            "guid": "12283f49-bd04-3685-a0fd-1acee2a641b9",
            "link": "https://finance.yahoo.com/m/12283f49-bd04-3685-a0fd-1acee2a641b9/lopsided-market-returns.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:22:00 +0000",
            "title": "Lopsided Market Returns"
        },
        {
            "description": "Apple stock hit a record high on Monday ahead of the debut of the company's mixed-reality headset, Vision Pro.",
            "guid": "4f63afeb-428f-3466-bb30-13560456a298",
            "link": "https://finance.yahoo.com/m/4f63afeb-428f-3466-bb30-13560456a298/apple-unveils-computer.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:16:51 +0000",
            "title": "Apple Unveils Computer Goggles For Augmented, Virtual Reality Called Vision Pro"
        },
        {
            "description": "The device allows users to experience virtual reality and digital apps overlaid on the real world. The company also unveiled key features for the iPhone and a 15-inch MacBook Air.",
            "guid": "328feada-4d81-3c3c-ba6c-4fab5bd3ea5b",
            "link": "https://finance.yahoo.com/m/328feada-4d81-3c3c-ba6c-4fab5bd3ea5b/apple-releases-vision-pro.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:15:00 +0000",
            "title": "Apple Releases Vision Pro Headset, First Major New Product in a Decade"
        },
        {
            "description": "The S&P 500 ended lower on Monday as investors weighed whether the U.S. Federal Reserve might pause its interest rate hikes at its upcoming policy meeting, while Apple briefly hit a record high before losing ground.  Apple Inc ended 0.8% lower after the world's most valuable company unveiled an augmented-reality headset called the Vision Pro, its riskiest and biggest bet since the introduction of the iPhone.",
            "guid": "36d64416-19ac-3ce7-9342-5d28fd81ad27",
            "link": "https://finance.yahoo.com/news/us-stocks-p-500-ends-201408998.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:14:08 +0000",
            "title": "US STOCKS-S&P 500 ends lower as traders eye potential pause in rate hikes"
        },
        {
            "description": "The Dow Jones slid while Apple stock reversed despite unveiling the Vision Pro headset. A Cathie Wood stock popped higher.",
            "guid": "9616599a-b8e9-31e3-8b5c-e301309395bb",
            "link": "https://finance.yahoo.com/m/9616599a-b8e9-31e3-8b5c-e301309395bb/dow-jones-falls-as-apple.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:10:02 +0000",
            "title": "Dow Jones Falls As Apple Unveils These Products; This Stock Soars After Cathie Wood Sells It"
        },
        {
            "description": "Stocks ended the day in the red on Monday as tech erased some of its gains that had brought the S&P 500 close to a key level. The Dow Jones Industrial Average fell 199.9 points or 0.6%. But the S&P 500's 0.",
            "guid": "754c45e9-524c-356e-b3be-548bac09e142",
            "link": "https://finance.yahoo.com/m/754c45e9-524c-356e-b3be-548bac09e142/stocks-close-lower-to-kick.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:09:21 +0000",
            "title": "Stocks Close Lower to Kick Off the Week"
        },
        {
            "description": "Vision Pro -- and social media is in a frenzy.  Apple made a lot of claims that the headset would change how people would work, whether in the office or remotely.  Apple also showed unique ways to enhance media consumption, making interacting with characters or sporting events feel more authentic.",
            "guid": "9f64e395-6019-3010-b890-594514d46595",
            "link": "https://finance.yahoo.com/m/9f64e395-6019-3010-b890-594514d46595/apple%27s-vision-pro-headset.html?.tsrc=rss",
            "pubDate": "Mon, 05 Jun 2023 20:07:00 +0000",
            "title": "Apple's Vision Pro Headset Has Social Media Confused"
        }
    ],
    "language": "en-US",
    "lastBuildDate": "Mon, 05 Jun 2023 21:15:18 +0000"
}